spikes/sp4-agent-mutation/evidence/dto-001-commit.diff
commit 273a1ae67f19074699d89fa92df4e8c6b60655c0
Author: Ivan Bogomazov <ivan.bogomazov@gmail.com>
Date:   Tue Aug 25 11:19:29 2026 -0400

    instrument: apply dto-001 (agents/intake.py telemetry wrap)

diff --git a/agents/intake.py b/agents/intake.py
index 22059cd..08ed9a0 100644
--- a/agents/intake.py
+++ b/agents/intake.py
@@ -9,6 +9,7 @@ import anthropic
 from rich.panel import Panel
 from rich.text import Text
 
+import oah_telemetry
 from beacon_logging import get_logger
 from config import INTAKE_MODEL
 from llm import cached_system, cached_tools
@@ -53,6 +54,7 @@ def run_intake_agent(client: anthropic.Anthropic) -> PatientProfile:
     ]
 
     while True:
+        oah_telemetry.emit("gen_ai.request.start", model=INTAKE_MODEL)
         response = client.messages.create(
             model=INTAKE_MODEL,
             max_tokens=1024,
@@ -60,6 +62,7 @@ def run_intake_agent(client: anthropic.Anthropic) -> PatientProfile:
             tools=cached_tools(INTAKE_TOOLS),
             messages=messages,
         )
+        oah_telemetry.emit("gen_ai.request.end", model=INTAKE_MODEL)
 
         text = next((b.text for b in response.content if b.type == "text"), "")
         if text:
